{
	"experience": [
		{
			"companyName": "Instaleap",
			"link": "https://instaleap.io/",
			"position_eng": "Front-end Engineer",
			"position_esp": "Ingeniero Front-end",
			"startDate": "2022-11-01",
			"descriptions_eng": [
				"Develop and design views, features, and robust infrastructures for a recognized e-commerce platform.",
				"Utilize primarily tools such as React, Next.js, Webpack, Rollup, and Ant Design to enhance the platform relied upon by thousands of users.",
				"Participate consistently in the architectural process and decisions to meet product requirements and provide value to all stakeholders."
			],
			"descriptions_esp": [
				"Desarrollar y diseñar vistas, modulos e infraestructurs robustas para una plataforma de e-commerce reconocida.",
				"Usar herramientas como React, Next.js, Webpack, Rollup y Ant Design para mejorar la plataforma en la que confían miles de usuarios.",
				"Participar de manera constante en el proceso de arquitectura y en la toma de decisiones para cumplir con los requisitos de producto y brindar valor a todas las partes interesadas."
			]
		},
		{
			"companyName": "Grupo 525",
			"link": "https://cincoveinticinco.com/",
			"position_eng": "Front-end Engineer",
			"position_esp": "Ingeniero Front-end",
			"startDate": "2020-03-01",
			"endDate": "2022-11-01",
			"descriptions_eng": [
				"Develop and maintain in-house and clients' software mainly for cinema and television networks.",
				"Work with a variety of different languages, platforms, frameworks and tools such as JavaScript, TypeScript, Angular 2+, Ruby on Rails, among others.",
				"Architect and implement front-end solutions for different clients including Netflix, Sony Pictures, Telemundo, RCN Colombia and more."
			],
			"descriptions_esp": [
				"Desarrollar y mantener software dedicado para producción de cine y televisión.",
				"Trabajar con varios lenguajes, plataformas, frameworks y herramientas como JavaScript, TypeScript, Angular 2+, Ruby on Rails, entre otros.",
				"Proponer e implementar arquitecturas y soluciones front-end para diferentes clientes como Netflix, Sony Pictures, Telemundo, RCN Colombia, etc."
			]
		},
		{
			"companyName": "Front-end Freelancer",
			"link": "https://www.linkedin.com/in/ylrodriguez/",
			"position_eng": "Front-end Developer",
			"position_esp": "Desarrollador Front-end",
			"startDate": "2019-02-01",
			"endDate": "2020-03-01",
			"descriptions_eng": [
				"Update legacy software and improve user interfaces from different local companies such as Casa Luker and Tybasoft.",
				"Develop using different tools such as HTML5, CSS3, Angular 2+, SASS, Bootstrap, SVG animations, REST services, among others."
			],
			"descriptions_esp": [
				"Actualizar software antiguo y mejorar interfaces de usuario de diferentes clientes como Casa Luker y Tybasoft.",
				"Desarollar aplicaciones usando diferentes herramientas como HTML5, CSS3, Angular 2+, SASS, Bootstrap, animaciones SVG, servicios REST, entre otros."
			]
		},
		{
			"companyName": "Universidad Distrital",
			"link": "http://idexud.udistrital.edu.co/?p=158",
			"position_eng": "Jr. Software Developer",
			"position_esp": "Desarrollador de Software Jr.",
			"startDate": "2018-01-01",
			"endDate": "2018-07-01",
			"descriptions_eng": [
				"Manage and maintain internal system according to all the needs of the internal software and also one main project called 'Conocí-siento'.",
				"Work with the following technologies: Angular, JavaScript, Laravel and MySQL",
				"Develop and adapt existing modules to generate reports and final products."
			],
			"descriptions_esp": [
				"Administrar y mantener el sistema interno de acuerdo a las necesidades del software interno y del proyecto 'Conocí-siento'.",
				"Trabajar con las siguientes tecnologías: Angular, JavaScript Laravel y MySQL",
				"Desarrollar y adaptar módulos existentes para generar reportes y productos finales."
			]
		}
	]
}